---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinkLoadResult
source: html/2550c7b5-2489-8eab-4116-392d54059bb9.htm
---
# LinkLoadResult Methods

Gets the central model's name.
 If the link is not workshared, this returns an empty FilePath.
 If the link is itself a central model, this returns the link's name.